[
  {
    "title": "The 10th Tzu Chi Forum",
    "theme": "Technology for Goodness",
    "quote": "\"Leveraging innovation to cultivate a world of compassion and sustainable well-being.\"",
    "country": "Hongkong",
    "dates": "2025-12-04;2025-12-05",
    "locations": "Hang Seng University, Hong Kong<br>(Main Campus) A401;Tzu Chi Charity Foundation, Kowloon Tong<br>(12 Suffolk Road, Kowloon Tong)",
    "target_audience": "Leaders in Academia, Research, Public Services, Industry, and NGOs, approximately 150 to 200 pax",
    "description": "In today's world, we are faced with a host of interconnected and complex challenges: extreme disasters driven by climate change, persistent inequality in the distribution of resources, worsening humanitarian crises, and ethical dilemmas arising from the rapid advancement of artificial intelligence and digital technologies. These \"wicked problems\" can no longer be addressed effectively by any single sector or organization alone. Instead, they demand integrated, cross-disciplinary thinking and collaborative solutions.;\r\nAs an international humanitarian organization grounded in the core value of altruism, the Tzu Chi Foundation draws its founding principles from the compassion of Buddhist teachings and puts altruism into practice throughout society. Master Cheng Yen, the founder, has called on professionals from all walks of life to join in advancing humanitarian care and social ethics.;\r\n\"Technology for Goodness\" emphasizes the integration of care, empathy, and ethical considerations into the application of technology. Whether in disaster response, healthcare, equitable education, or environmental sustainability, using technology ethically and for goodness of society is a vital pathway for fostering cross-sector collaboration and addressing the pressing challenges facing humanity.;\r\nThe 10th Tzu Chi Forum, themed \"Technology for Goodness,\" explores how we can harmonize humanistic values with modern technology and promote interdisciplinary collaboration. The forum seeks pathways to balance technological advancement with human-centered care, and to develop innovative solutions rooted in altruism and common goodness. By advancing ethical technology, social welfare, and sustainable development, the forum aims to address the world's most complex challenges."
  }
]
